In [1]:
import pandas as pd

In [2]:
dados_cadastro = {'Id': [120, 333, 444, 532], 
     'Idade': [20, 43, 55, 32]}

df_cadastro = pd.DataFrame(data=dados_cadastro)
df_cadastro

    Id  Idade
0  120     20
1  333     43
2  444     55
3  532     32

In [3]:
dados_uf = {'Id': [120, 333, 444, 532], 
     'UF': ['PA', 'SP', 'SP', 'PA']}

df_uf = pd.DataFrame(data=dados_uf)
df_uf

    Id  UF
0  120  PA
1  333  SP
2  444  SP
3  532  PA

In [4]:
# Equivalente ao PROCV do Excel
pd.merge(df_cadastro, df_uf, on='Id', how='left')

    Id  Idade  UF
0  120     20  PA
1  333     43  SP
2  444     55  SP
3  532     32  PA

In [5]:
df_full_cadastro =  pd.merge(df_cadastro, df_uf, on='Id', how='left')
df_full_cadastro

    Id  Idade  UF
0  120     20  PA
1  333     43  SP
2  444     55  SP
3  532     32  PA

In [6]:
dados_compra = {'Id': [120, 333, 444, 532, 444, 333], 
     'Vlr_Compra': [300, 230, 140, 150, 220, 100]}

df_compra = pd.DataFrame(data=dados_compra)
df_compra

    Id  Vlr_Compra
0  120         300
1  333         230
2  444         140
3  532         150
4  444         220
5  333         100

In [7]:
df_cadastro_c_compras = pd.merge(df_full_cadastro, df_compra, on='Id', how='left')

In [8]:
df_cadastro_c_compras

    Id  Idade  UF  Vlr_Compra
0  120     20  PA         300
1  333     43  SP         230
2  333     43  SP         100
3  444     55  SP         140
4  444     55  SP         220
5  532     32  PA         150

In [9]:
df_cadastro_c_compras.groupby('Id')['Vlr_Compra'].mean()

Id
120    300.0
333    165.0
444    180.0
532    150.0
Name: Vlr_Compra, dtype: float64

In [10]:
df_cadastro_c_compras.groupby('Id')['Vlr_Compra'].sum()

Id
120    300
333    330
444    360
532    150
Name: Vlr_Compra, dtype: int64

In [11]:
df_cadastro_c_compras.groupby('Id')['Vlr_Compra'].count()

Id
120    1
333    2
444    2
532    1
Name: Vlr_Compra, dtype: int64

In [12]:
# E se tiver nomes diferentes?
dados_compra = {'Chave_Identificacao': [120, 333, 444, 532, 444, 333], 
     'Vlr_Compra': [300, 230, 140, 150, 220, 100]}

df_compra = pd.DataFrame(data=dados_compra)
df_compra

   Chave_Identificacao  Vlr_Compra
0                  120         300
1                  333         230
2                  444         140
3                  532         150
4                  444         220
5                  333         100

In [13]:
pd.merge(df_full_cadastro, df_compra, left_on='Id', right_on = 'Chave_Identificacao', how='left')

    Id  Idade  UF  Chave_Identificacao  Vlr_Compra
0  120     20  PA                  120         300
1  333     43  SP                  333         230
2  333     43  SP                  333         100
3  444     55  SP                  444         140
4  444     55  SP                  444         220
5  532     32  PA                  532         150

In [14]:
pd.merge(df_full_cadastro[['Id', 'Idade']], df_compra, left_on='Id', right_on = 'Chave_Identificacao', how='left')

    Id  Idade  Chave_Identificacao  Vlr_Compra
0  120     20                  120         300
1  333     43                  333         230
2  333     43                  333         100
3  444     55                  444         140
4  444     55                  444         220
5  532     32                  532         150

In [15]:
df_desconto = pd.DataFrame(data={'Id': [120, 333], 
     'Desconto': [30, 10]})

df_desconto

    Id  Desconto
0  120        30
1  333        10

In [16]:
pd.merge(df_full_cadastro, df_desconto, on='Id', how='left')

    Id  Idade  UF  Desconto
0  120     20  PA      30.0
1  333     43  SP      10.0
2  444     55  SP       NaN
3  532     32  PA       NaN

In [17]:
pd.merge(df_full_cadastro, df_desconto, on='Id', how='outer')

    Id  Idade  UF  Desconto
0  120     20  PA      30.0
1  333     43  SP      10.0
2  444     55  SP       NaN
3  532     32  PA       NaN

In [18]:
pd.merge(df_full_cadastro, df_desconto, on='Id', how='right')

    Id  Idade  UF  Desconto
0  120     20  PA        30
1  333     43  SP        10

In [19]:
df_desconto = pd.DataFrame(data={'Id': [120, 333, 555], 
     'Desconto': [30, 10, 100]})

df_desconto

    Id  Desconto
0  120        30
1  333        10
2  555       100

In [20]:
pd.merge(df_full_cadastro, df_desconto, on='Id', how='right')

    Id  Idade   UF  Desconto
0  120   20.0   PA        30
1  333   43.0   SP        10
2  555    NaN  NaN       100

In [21]:
pd.merge(df_full_cadastro, df_desconto, on='Id', how='left', indicator=True)

    Id  Idade  UF  Desconto     _merge
0  120     20  PA      30.0       both
1  333     43  SP      10.0       both
2  444     55  SP       NaN  left_only
3  532     32  PA       NaN  left_only

In [22]:
pd.merge(df_full_cadastro, df_desconto, on='Id', how='left', indicator=True).query('_merge != "both"')

    Id  Idade  UF  Desconto     _merge
2  444     55  SP       NaN  left_only
3  532     32  PA       NaN  left_only